VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
static void link_dump_bytes(const char *tag, const uint8_t *p, uint32_t n)
{
    dbg_puts(tag);
    dbg_puts("\n  ");
    for (uint32_t i = 0u; i < n; ++i) {
        static const char digits[] = "0123456789abcdef";
        dbg_putc(digits[(p[i] >> 4) & 0xFu]);
        dbg_putc(digits[p[i] & 0xFu]);
        dbg_putc(' ');
    }
    dbg_puts("\n");
}

// Watch the live peripheral for a while and report what MOVED, rather than a
// single instantaneous sample. A stuck link and a running one look identical
// in one snapshot of SR.
static void link_watch(void)
{
    uint32_t sr_or = 0u;
    uint32_t rxcount_max = 0u;
    uint32_t txcount_min = 0xFFFFFFFFu;
    uint32_t citer_tx_seen = 0u;
    uint32_t citer_rx_seen = 0u;
    uint32_t saddr_first = LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_SADDR;
    uint32_t saddr_changed = 0u;

    for (uint32_t n = 0u; n < 300000u; ++n) {
        sr_or |= LINK_SPI->SR;
        uint32_t fsr = LINK_SPI->FSR;
        uint32_t rxc = (fsr & LPSPI_FSR_RXCOUNT_MASK) >> LPSPI_FSR_RXCOUNT_SHIFT;
        uint32_t txc = (fsr & LPSPI_FSR_TXCOUNT_MASK) >> LPSPI_FSR_TXCOUNT_SHIFT;
        if (rxc > rxcount_max) {
            rxcount_max = rxc;
        }
        if (txc < txcount_min) {
            txcount_min = txc;
        }
        citer_tx_seen |= 1uL << (LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_CITER_ELINKNO & 0xFu);
        citer_rx_seen |= 1uL << (LINK_DMA->CH[LINK_DMA_CHANNEL_RX].TCD_CITER_ELINKNO & 0xFu);
        if (LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_SADDR != saddr_first) {
            saddr_changed = 1u;
        }
    }

    dbg_puts("-- watch (OR/extremes over ~300k samples) --\n");
    link_show("SR   (or)    ", sr_or);
    link_show("FSR rxcnt max", rxcount_max);
    link_show("FSR txcnt min", txcount_min);
    link_show("tx CITER seen", citer_tx_seen);
    link_show("rx CITER seen", citer_rx_seen);
    link_show("tx SADDR movd", saddr_changed);
    dbg_puts("  (SR bits: 0=TDF 1=RDF 8=WCF 9=FCF 10=TCF 11=TEF 12=REF 24=MBF)\n");
    dbg_puts("  (CITER seen is a BITMASK of observed values; one bit => frozen)\n");
}

// --- RX retirement ---------------------------------------------------------

// Feed retired FPGA->MCU telemetry into the injection session. link_retire_slot
// enqueues every deliverable (SPI_FRAME_OK, non-IDLE) frame; the session only
// acts on REPORT_FRAGMENT (learn the target report's addressing and descriptor
// generation) and MAP_STATUS (the map-commit handshake).
static void link_inject_consume(void)
{
    inj_frame_t frame;
    while (link_retire_receive(&frame)) {
        if (frame.type == INJ_TYPE_REPORT_FRAGMENT) {
            inj_report_fragment_payload_t fragment;
            memcpy(&fragment, frame.payload, sizeof(fragment));
            inj_session_observe_report(&s_inj, &fragment);
        } else if (frame.type == INJ_TYPE_MAP_STATUS) {
            inj_map_status_payload_t status;
            memcpy(&status, frame.payload, sizeof(status));
            inj_session_observe_map_status(&s_inj, &status);
        }
    }
}

// Stage the session's next command into the TX bank the DMA does not own, one
// slot ahead of transmission. Mirrors link_drain_rx's ownership rule against the
// live source address; a torn write costs at most one command to a CRC reject,
// which the session re-attempts. With nothing to send the bank is refilled with
// IDLE, so the self-loading ring never re-transmits a stale command.
static void link_inject_refill_tx(void)
{
    uint8_t active;
    if (!link_retire_active_bank(LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_SADDR,
                                 (uint32_t)s_tx_bank[0], INJ_FRAME_SIZE,
                                 (uint8_t)LINK_SLOT_BANKS, &active)) {
        s_saddr_out_of_range++;
        return;
    }
    uint8_t target = link_next_bank(active);
    if (!inj_session_fill_tx(&s_inj, s_tx_bank[target])) {
        link_build_idle_slot(s_tx_bank[target]);
    }
}

// Retire every bank between the cursor and the one the DMA is currently
// writing. Bounded by LINK_SLOT_BANKS iterations by construction: the loop
// stops at `active`, and `active` is always a valid bank index.
//
// This is design doc section 4's "only ever touch the bank the DMA is *not*
// pointing at", implemented rather than assumed. The live TCD destination
// address is the only thing on this part that knows where the engine is; see
// link_retire.h for why a software ping-pong counter is not a substitute.
static void link_drain_rx(void)
{
    uint8_t active;

    // Reflect the transport into the session first. set_link is idempotent: it
    // only arms map upload on the down->up edge and tears all learned state
    // down when the link drops (an ERR051588 recovery holds mcu_ready low for
    // its whole duration, which is exactly when the map must be abandoned).
    inj_session_set_link(&s_inj, s_ready);

    if (!link_retire_active_bank(LINK_DMA->CH[LINK_DMA_CHANNEL_RX].TCD_DADDR,
                                 (uint32_t)s_rx_bank[0], INJ_FRAME_SIZE,
                                 (uint8_t)LINK_SLOT_BANKS, &active)) {
        // The destination address is not inside the bank array at all: a
        // corrupted or never-installed descriptor. Retire nothing -- there is
        // no bank that can be shown to be safe.
        s_daddr_out_of_range++;
        return;
    }

    if (s_rx_cursor == active) {
        // A completion arrived but the only bank we had left to retire is the
        // one now being written. Retirement is a full rotation behind and this
        // slot is lost. Self-healing: the next completion moves `active` on
        // and the cursor is free again.
        s_retire_stalls++;
        return;
    }

    while (s_rx_cursor != active) {
        link_retire_slot(s_rx_bank[s_rx_cursor]);

        // Only touch the injection path while the link is up and steady. During
        // an ERR051588 recovery mcu_ready is low and the ladder is rebuilding
        // the TX banks itself, so retirement and the snapshot below still run
        // but no command is consumed or emitted.
        if (s_ready) {
            link_inject_consume();
        }

        // shared_window_reset() runs after link_init() has enabled this ISR.
        // Its magic-first invalidation prevents the reset from racing this
        // writer; once magic is published, every retired slot gets exactly one
        // snapshot publication at the MCU's own ~8 kHz retirement cadence.
        if (g_shared_window.magic == SHARED_WINDOW_MAGIC) {
            const link_retire_counters_t *counters = link_retire_counters();
            link_snapshot_t snapshot = {0};
            snapshot.slot_counter = counters->slots;
            // Descriptor and map generations now have a real source: what the
            // session last learned from REPORT_FRAGMENT / MAP_STATUS. Each reads
            // zero until the session learns it -- honest rather than invented.
            snapshot.descriptor_generation = s_inj.descriptor_generation;
            snapshot.map_generation = s_inj.active_map_generation;
            snapshot.link_flags = (uint16_t)(
                (s_ready ? INJ_LINK_STATUS_FLAG_RELAY_READY : 0u) |
                (s_inj.active_map_generation != 0u ? INJ_LINK_STATUS_FLAG_MAP_ACTIVE : 0u) |
                (inj_session_phase(&s_inj) == INJ_PHASE_INJECTING
                     ? INJ_LINK_STATUS_FLAG_INJECTION_ENABLED
                     : 0u));
            link_snapshot_publish(&g_shared_window.snapshot, &snapshot);
        }
        s_rx_cursor = link_next_bank(s_rx_cursor);
    }

    // One command per drain, staged a slot ahead of the wire. Kept out of the
    // per-slot loop so a catch-up drain of several banks still emits a single
    // fresh frame rather than racing several writes into one bank.
    if (s_ready) {
        link_inject_refill_tx();
    }
}

