VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
// eDMA0 channel 1 major-loop completion: one received slot.
//
// The name is `EDMA_0_CH1_DriverIRQHandler`, not `EDMA_0_CH1_IRQHandler`. The
// vector table entry is a weak trampoline that branches to the Driver name,
// and it is the Driver name that startup_MCXN947_cm33_core0.S `.set`s to
// DefaultISR -- so rooting the vector name would pass the "is it defined?"
// question against the vendor's own trampoline and prove nothing. The
// Makefile's CORE0_RETAIN roots this symbol and `make check` asserts it is a
// strong definition owned by this object.
//
// Retirement runs HERE and not in the foreground. A two-bank ring gives 250 us
// of slack; a foreground that also drives a 115200-baud report spends ~17 ms
// inside one print and would miss seventy rotations. The cost is ~10 us of ISR
// per 125 us slot, nearly all of it the bitwise CRC-16 over 30 bytes.
void EDMA_0_CH1_DriverIRQHandler(void);
void EDMA_0_CH1_DriverIRQHandler(void)
{
    // Clear the channel interrupt request before retiring rather than after.
    // CH_INT is a single W1C bit, so a completion that lands while we are
    // draining coalesces into the next entry either way -- but clearing first
    // means that entry actually happens instead of being cleared away.
    LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_INT = DMA_CH_INT_INT_MASK;
    s_isr_entries++;
    link_drain_rx();
}

// --- Frame alignment -------------------------------------------------------
//
// THE MEASUREMENT. A boot can come up with the whole 256-bit slot permanently
// offset, and it is boot-random: two consecutive flashes of a byte-identical
// image, nothing else changed, came up 69 bits out and then perfectly aligned.
// The offset does not decay -- it held for the entire 20 s the board ran.
//
// It is invisible to every status register. No underrun, no overrun, no DMA
// error; SR reads exactly as it does on a healthy link. On the FPGA the only
// symptom is spi_bad_sof at 1:1 with spi_slots, which is the saturated
// non-discriminating signature step 2 already recorded for any whole-slot
// corruption. It was only nameable once retirement made the received bytes
// readable: decoded, the stream was the FPGA's own IDLE keepalive rotated right
// by exactly 69 bits.
//
// THE HYPOTHESIS, which is weaker than the measurement. Enabling the module
// mid-burst leaves the boundary wherever the burst had got to. Waiting for the
// gap between frames before setting CR[MEN] should therefore start it clean.
// Reading the chip select while LPSPI6 is disabled is what that needs, and
// SR[MBF] cannot serve -- a disabled module reports nothing. GPIO3->PDIR can:
// PDIR reflects the pad whatever the PORT mux selects, provided PCR[IBE] is
// set, which link_pins_init() sets on all four link pins for the peripheral's
// own benefit. So the chip select is readable as a plain input at the same time
// as it is wired to PCS0.
//
// EVIDENCE FOR IT: 7 of 7 boots clean with this wait, against 1 of 2 without.
// Suggestive, not proven -- n = 2 on the control side -- and three deliberate
// attempts to reproduce the offset at run time all failed (see
// link_demo_perturb_rx). The mechanism is NOT established, and a claim resting
// on "the boundary is latched at CR[MEN]" should not be built on this.
//
// WHAT THE FRAMING MONITOR DOES AND DOES NOT BUY, corrected against the
// 20-boot experiment that closed step 3 and superseded what stood here:
//
//   * A RECOVERY whose own re-arm lands mis-framed IS repaired. Measured on
//     the bench -- detected and corrected 60 ms later at a cost of 480 bad
//     slots, after which the link ran flat.
//   * A BOOT that comes up mis-framed is NOT. Measured: the ladder ran ~220
//     times against one such boot and never repaired it. It needs a reset.
//     See PROVENANCE.md and design doc section 10.
//
// So the wait is not best-effort scaffolding backed by a converging monitor,
// and the sentence that used to end this block -- "alignment converges rather
// than depending on a lucky boot" -- was measured false. The wait is the only
// mitigation there is for the boot case (20/20 with it, 16/20 without), and
// the monitor's role there is to NAME the condition, not to fix it.
#define LINK_GAP_WAIT_SPINS 4000000u

// Wait for chip select to be ASSERTED and then RELEASED, so what follows is the
// start of an idle window rather than its tail. At 8 kHz with a ~17 us burst
// the idle window is ~108 us, which is an eternity next to the two register
// writes that follow. Returns false if either edge did not arrive inside the
// spin budget -- the caller proceeds anyway, because an unaligned link that the
// monitor will repair beats a link that never comes up at all.
#if !defined(LINK_SKIP_GAP_WAIT)
static bool link_wait_for_interframe_gap(void)
{
    const uint32_t cs = 1uL << LINK_PIN_CS;  // active low
    uint32_t spins = 0u;

    while ((GPIO3->PDIR & cs) != 0u) {
        if (++spins >= LINK_GAP_WAIT_SPINS) {
            return false;
        }
    }
    spins = 0u;
    while ((GPIO3->PDIR & cs) == 0u) {
        if (++spins >= LINK_GAP_WAIT_SPINS) {
            return false;
        }
    }
    return true;
}
#endif  // !LINK_SKIP_GAP_WAIT

static uint32_t s_gap_wait_timeouts;

// Enable LPSPI6 on a frame boundary. The only place CR[MEN] is ever set.
static void link_spi_enable_aligned(void)
{
    // TEMPORARY EXPERIMENT SWITCH -- REMOVE WITH THE SCAFFOLDING.
    // -DLINK_SKIP_GAP_WAIT builds the control arm: enable the module without
    // waiting for the inter-frame gap. The gap wait is a HYPOTHESIS about the
    // boot-random frame offset, measured at 7/7 clean with it and 1/2 without,
    // and n=2 is not a prior. This switch exists to get one -- and it has now
    // given one: 20/20 clean with the wait against 16/20 without.
    //
    // The line that used to stand here called the control arm safe "because
    // link_retire_framing_lost() + the section 4 ladder repair a mis-framed
    // boot within ~60 ms". That was measured false; the ladder does not repair
    // a mis-framed boot at all. A control-arm boot that comes up offset stays
    // offset until it is reset. The switch is safe to build, not to rely on.
#if !defined(LINK_SKIP_GAP_WAIT)
    if (!link_wait_for_interframe_gap()) {
        s_gap_wait_timeouts++;
    }
#endif
    LINK_SPI->CR = LPSPI_CR_MEN_MASK;
}

// --- ERR051588 -------------------------------------------------------------

// Bounded spin for CH_CSR[ACTIVE] to fall. A channel is at most one 4-byte
// minor loop from idle once its request is off, so this is orders of magnitude
// more than needed; it exists so a wedged controller cannot hang the recovery.
#define LINK_RECOVERY_WAIT_SPINS 100000u

// Storm guard: the minimum gap between two recoveries. See link_poll().
#define LINK_RECOVERY_MIN_GAP_MS 20u

static void link_read_fault(link_fault_t *fault)
{
    const uint32_t sr = LINK_SPI->SR;
    const uint32_t tx_es = LINK_DMA->CH[LINK_DMA_CHANNEL_TX].CH_ES;
    const uint32_t rx_es = LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_ES;
    const uint32_t tx_csr = LINK_DMA->CH[LINK_DMA_CHANNEL_TX].CH_CSR;
    const uint32_t rx_csr = LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_CSR;

    fault->lpspi_transmit_error = (sr & LPSPI_SR_TEF_MASK) != 0u;
    fault->lpspi_receive_error = (sr & LPSPI_SR_REF_MASK) != 0u;
    fault->dma_channel_error = ((tx_es | rx_es) & DMA_CH_ES_ERR_MASK) != 0u;
    fault->dma_controller_halted = (LINK_DMA->MP_CSR & DMA_MP_CSR_HALT_MASK) != 0u;
    // Read, reported, and deliberately not acted on. See link_recovery.h: DONE
    // is sticky status that a scatter-gather reload never clears, so on a
    // healthy self-loading ring it reads set forever.
    fault->dma_channel_done_latched = ((tx_csr | rx_csr) & DMA_CH_CSR_DONE_MASK) != 0u;

    // The one term that comes from the retired content rather than a register.
    // Filled in by link_poll(), which owns the sampling window.
    fault->receive_framing_lost = false;
}

// One rung of design doc section 4's ladder. The ORDER is not decided here --
// link_recovery.c owns it and test/link_recovery_test.c asserts each ordering
// clause the design states. This function only knows how to perform a rung.
static void link_recovery_apply(void *ctx, link_recovery_op_t op)
{
    (void)ctx;

    switch (op) {
    case LINK_RECOVERY_OP_MCU_READY_LOW:
        // Rung 1, and it must be first. `send_message = mcu_ready & tx_queued`
        // on the FPGA, so this stops it consuming what we emit; and all four
        // spi_bad_* counters are gated on `transfer_ready`, latched from this
        // pin at slot start, so the garbage still in flight is ignored rather
        // than counted against us.
        link_mcu_ready_set(false);
        break;

