VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
    case LINK_RECOVERY_OP_REQUESTS_OFF:
        EDMA_DisableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
        EDMA_DisableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_RX);
        // Mask the retirement ISR for the same window. Nothing may retire a
        // bank while the descriptors are being rewritten underneath it.
        NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
        break;

    case LINK_RECOVERY_OP_WAIT_CHANNELS_IDLE: {
        uint32_t spins = 0u;
        while (((LINK_DMA->CH[LINK_DMA_CHANNEL_TX].CH_CSR |
                 LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_CSR) &
                DMA_CH_CSR_ACTIVE_MASK) != 0u) {
            if (++spins >= LINK_RECOVERY_WAIT_SPINS) {
                s_recovery_wait_timeouts++;
                break;
            }
        }
        break;
    }

    case LINK_RECOVERY_OP_RESET_FIFOS:
        // Rung 3, and the erratum's own workaround: "reset the transmit FIFO
        // (CR[RTF] = 1) before writing any new data". RRF goes with it because
        // the receive FIFO may hold the tail of a frame that no longer has a
        // matching transmit side. MEN is left alone -- RTF/RRF are
        // self-clearing commands and the vendor's own LPSPI_FlushFifo() writes
        // them with the module enabled.
        LINK_SPI->CR |= LPSPI_CR_RTF_MASK | LPSPI_CR_RRF_MASK;
        // SR's error flags are W1C. TCF is cleared with them so the next
        // frame-complete is unambiguous.
        LINK_SPI->SR = LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_TCF_MASK;
        // ...and then disable the module. This is a DEVIATION from design doc
        // section 4's ladder, which does not mention MEN, and it is what makes
        // the ladder able to repair a mis-framed slave rather than only an
        // underrun one: the frame boundary is latched at MEN and a disabled
        // module ignores SCK entirely, so dropping it here is what lets rung 5
        // choose a new boundary in the inter-frame gap.
        LINK_SPI->CR &= ~(uint32_t)LPSPI_CR_MEN_MASK;
        break;

    case LINK_RECOVERY_OP_CLEAR_CHANNEL_STATE:
        // Rung 4a. DONE is cleared because the design says to, not because it
        // meant anything; ERROR and HALT are cleared because they do.
        // enableHaltOnError is true by default, so an error on either channel
        // stops BOTH, and a TCD installed into a halted controller arms
        // nothing at all.
        EDMA_ClearChannelStatusFlags(LINK_DMA, LINK_DMA_CHANNEL_TX,
                                     (uint32_t)kEDMA_DoneFlag | (uint32_t)kEDMA_ErrorFlag |
                                         (uint32_t)kEDMA_InterruptFlag);
        EDMA_ClearChannelStatusFlags(LINK_DMA, LINK_DMA_CHANNEL_RX,
                                     (uint32_t)kEDMA_DoneFlag | (uint32_t)kEDMA_ErrorFlag |
                                         (uint32_t)kEDMA_InterruptFlag);
        LINK_DMA->MP_CSR &= ~(uint32_t)DMA_MP_CSR_HALT_MASK;
        break;

    case LINK_RECOVERY_OP_REARM_RINGS:
        // Rung 4b. Re-seed both TX banks first, then rewrite the descriptors:
        // the steady-state invariant is that the buffer the DMA will next read
        // is never empty and never half written, and the moment the descriptor
        // is installed is the moment that becomes true again.
        for (uint8_t bank = 0u; bank < LINK_SLOT_BANKS; ++bank) {
            link_build_idle_slot(s_tx_bank[bank]);
        }
        link_dma_rings_install();
        break;

    case LINK_RECOVERY_OP_REQUESTS_ON: {
        NVIC_ClearPendingIRQ(EDMA_0_CH1_IRQn);
        NVIC_EnableIRQ(EDMA_0_CH1_IRQn);
        EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
        EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_RX);

        // The module comes back on a frame boundary, and only here -- the same
        // call the boot path uses, so there is one expression of the rule.
        link_spi_enable_aligned();

        // Do not leave until the FIFO actually holds a whole slot again. The
        // steady-state invariant is that the buffer the DMA will next read is
        // never empty; the FIFO is 8 x 32 bits = exactly one slot, and the eight
        // DMA moves that fill it take well under a microsecond against the
        // ~108 us of idle wire this rung is standing in. Leaving early would
        // hand the next frame a half-full FIFO, which underruns -- the fault,
        // again, manufactured by its own recovery.
        uint32_t spins = 0u;
        while (((LINK_SPI->FSR & LPSPI_FSR_TXCOUNT_MASK) >> LPSPI_FSR_TXCOUNT_SHIFT) <
               (LINK_TX_WATERMARK + 1u)) {
            if (++spins >= LINK_RECOVERY_WAIT_SPINS) {
                s_recovery_fill_timeouts++;
                break;
            }
        }
        break;
    }

    case LINK_RECOVERY_OP_MCU_READY_HIGH:
        // Rung 6, and it must be last: this is the edge that makes the FPGA
        // start scoring us again, so nothing may still be half-armed.
        //
        // SR is cleared once more immediately before the edge. The window
        // between the FIFO reset in rung 3 and the refill in rung 5 is one in
        // which the FPGA is still clocking an empty transmit FIFO, so it sets
        // SR[TEF] by construction -- a fault caused by the recovery rather than
        // found by it. Leaving it latched would have the monitor read it on its
        // very next pass and recover forever, 8,000 times a second.
        LINK_SPI->SR = LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_TCF_MASK;
        link_mcu_ready_set(true);
        break;

    case LINK_RECOVERY_OP_COUNT:
    default:
        break;
    }
}

static void link_recover(const link_fault_t *fault)
{
    s_recoveries++;
    if (fault->receive_framing_lost) {
        s_framing_recoveries++;
    }
    s_last_fault_sr = LINK_SPI->SR;

    dbg_puts("!! ERR051588 recovery #");
    dbg_dec32(s_recoveries);
    dbg_puts("  SR=");
    dbg_hex32(s_last_fault_sr);
    dbg_puts(fault->lpspi_transmit_error ? " TEF" : "");
    dbg_puts(fault->lpspi_receive_error ? " REF" : "");
    dbg_puts(fault->dma_channel_error ? " CH_ES" : "");
    dbg_puts(fault->dma_controller_halted ? " HALT" : "");
    dbg_puts(fault->receive_framing_lost ? " FRAMING" : "");
    dbg_puts("\n");

    (void)link_recovery_run(link_recovery_apply, NULL);

    dbg_puts("   recovered, SR=");
    dbg_hex32(LINK_SPI->SR);
    dbg_puts(" FSR=");
    dbg_hex32(LINK_SPI->FSR);
    dbg_puts(" idle_timeouts=");
    dbg_dec32(s_recovery_wait_timeouts);
    dbg_puts(" fill_timeouts=");
    dbg_dec32(s_recovery_fill_timeouts);
    dbg_puts("\n");
}

